acpi
acpid
adobe-source-han-mono-cn-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-serif-cn-fonts
alacritty
alsa-firmware
alsa-plugins
android-sdk-platform-tools
android-tools
arandr
asoundconf
autoconf
automake
axel
b43-fwcutter
base
bat
bison
bluedevil
bluez
bluez-utils
ccls
clipit
code
code-marketplace
cowsay
ctags
cutefish-filemanager
deepin-account-faces
deepin-album
deepin-anything
deepin-api
deepin-boot-maker
deepin-calculator
deepin-calendar
deepin-clipboard
deepin-clone
deepin-community-wallpapers
deepin-compressor
deepin-control-center
deepin-daemon
deepin-desktop-base
deepin-desktop-schemas
deepin-device-formatter
deepin-dock
deepin-draw
deepin-editor
deepin-file-manager
deepin-font-manager
deepin-gtk-theme
deepin-icon-theme
deepin-image-viewer
deepin-launcher
deepin-menu
deepin-metacity
deepin-movie
deepin-music
deepin-network-utils
deepin-picker
deepin-polkit-agent
deepin-polkit-agent-ext-gnomekeyring
deepin-printer
deepin-pw-check
deepin-qt5integration
deepin-qt5platform-plugins
deepin-reader
deepin-screen-recorder
deepin-screensaver
deepin-screensaver-pp
deepin-session-shell
deepin-session-ui
deepin-shortcut-viewer
deepin-sound-theme
deepin-system-monitor
deepin-terminal
deepin-turbo
deepin-voice-note
deepin-wallpapers
deepin-wayland
deepin-wm
dhcpcd
dnsmasq
docker
docker-compose
docparser
dog
edk2-ovmf
efibootmgr
ethtool
exa
fakeroot
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-gtk
fcitx5-rime
feh
figlet
flameshot
flex
fortune-mod-archlinux
fpc
fzf
gcc
gimp
git
glances
gnome-nettool
gnome-todo
google-chrome
grub
gtkmm
htop
i3-gaps
i3blocks
i3lock
i3status
intel-ucode
iptables-nft
jdk8-openjdk
jetbrains-toolbox
kitty
kolourpaint
lazygit
libtool
libvirt
light
lightdm
linux
linux-firmware
lolcat
lxappearance
m4
make
man-db
ncurses5-compat-libs
neofetch
neovim
nerd-fonts-jetbrains-mono
netease-cloud-music
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
networkmanager-vpnc
ninja
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npm
nvidia
nvidia-prime
obs-studio
os-prober
pamac-aur
pandoc
paru
patch
pavucontrol
peek
php
picom
pkgconf
pulseaudio-alsa
pulseaudio-bluetooth
python-pyalsa
python2
python2-imaging
qemu-desktop
ranger
rofi
scrcpy
screenkey
sdcc
sddm
simplescreenrecorder
slock
smartmontools
startdde
sudo
texinfo
texlive-bibtexextra
texlive-fontsextra
texlive-games
texlive-humanities
texlive-langchinese
texlive-langcyrillic
texlive-langextra
texlive-langgreek
texlive-langjapanese
texlive-langkorean
texlive-music
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
texmaker
the_silver_searcher
tlp
tlp-rdw
tmux
tree
ttf-dejavu
ttf-droid
ttf-inconsolata
ttf-indic-otf
ttf-joypixels
ttf-linux-libertine
ttf-twemoji-color
typora-free-cn
ufw
unzip
v2ray
v2raya
variety
vi
vim
w3m
wemeet-bin
wget
which
wpa_supplicant
wqy-bitmapfont
wqy-microhei
wqy-microhei-lite
wqy-zenhei
xautolock
xclip
xf86-video-vesa
xfce4-screensaver
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xss-lock
yarn
yay
zip
zsh
